### Задание 1
Скачайте с сайта https://grouplens.org/datasets/movielens/ датасет любого размера. Определите какому фильму было выставлено больше всего оценок 5.0.

In [77]:
import pandas as pd

In [78]:
data_movies = pd.read_csv(r'.\ml-20m\movies.csv')
#data_ratings = pd.read_csv(r'.\ml-20m\ratings.csv')
data_ratings_5 = pd.read_csv(r'.\ml-20m\ratings.csv')[pd.read_csv(r'.\ml-20m\ratings.csv')['rating']==5]

In [79]:
data_joined = data_ratings_5.merge(data_movies, on='movieId', how='left')

In [80]:
data_joined.groupby('title').count().sort_values('movieId', ascending=False).head(1)

                                  userId  movieId  rating  timestamp  genres
title
Shawshank Redemption, The (1994)   31896    31896   31896      31896   31896

In [86]:
data_joined.groupby('title').count()[['movieId']].sort_values('movieId', ascending=False).head(1)

                                  movieId
title
Shawshank Redemption, The (1994)    31896

In [84]:
data_joined['title'].value_counts().head(1)

Shawshank Redemption, The (1994)    31896
Name: title, dtype: int64

In [87]:
title = data_joined.groupby('title')

In [93]:
title.count()[['movieId']].sort_values('movieId', ascending=False).head(1)

                                  movieId
title
Shawshank Redemption, The (1994)    31896

### Задание 2
По данным файла power.csv посчитайте суммарное потребление стран Прибалтики (Латвия, Литва и Эстония) категорий 4, 12 и 21 за период с 2005 по 2010 года. Не учитывайте в расчетах отрицательные значения quantity.

In [62]:
data_energy_consumption = pd.read_csv('power.csv')

In [63]:
filtered_countries_quantity = data_energy_consumption[data_energy_consumption['quantity']>0]

filtered_countries_country = filtered_countries_quantity[(filtered_countries_quantity['country']=='Latvia')|
                                                         (filtered_countries_quantity['country']=='Lithuania')|
                                                         (filtered_countries_quantity['country']=='Estonia')]

filtered_countries_category = filtered_countries_country[(filtered_countries_country['category']==4)|
                                                         (filtered_countries_country['category']==12)|
                                                         (filtered_countries_country['category']==21)]

filtered_countries_yyyy = filtered_countries_category[(filtered_countries_category['year']>2004)&
                                                      (filtered_countries_category['year']<2011)]

In [64]:
filtered_countries_yyyy['quantity'].sum()

240580.0

In [66]:
filtered_countries_Pribaltika = data_energy_consumption[(data_energy_consumption['quantity']>0)
                                                        &
                                                        ((data_energy_consumption['year']>2004)&
                                                        (data_energy_consumption['year']<2011))
                                                        &
                                                        ((data_energy_consumption['country']=='Latvia')|
                                                        (data_energy_consumption['country']=='Lithuania')|
                                                        (data_energy_consumption['country']=='Estonia'))
                                                        &
                                                        ((data_energy_consumption['category']==4)|
                                                        (data_energy_consumption['category']==12)|
                                                        (data_energy_consumption['category']==21))]

In [67]:
filtered_countries_Pribaltika['quantity'].sum()

240580.0

In [68]:
len(filtered_countries_Pribaltika)

347

In [69]:
data_energy_consumption[
                        (data_energy_consumption['quantity']>0)
                        &
                       ((data_energy_consumption['year']>2004)&
                        (data_energy_consumption['year']<2011))
                        &
                       ((data_energy_consumption['country']=='Latvia')|
                        (data_energy_consumption['country']=='Lithuania')|
                        (data_energy_consumption['country']=='Estonia'))
                        &
                       ((data_energy_consumption['category']==4)|
                        (data_energy_consumption['category']==12)|
                        (data_energy_consumption['category']==21))
                       ]['quantity'].sum()

240580.0

In [70]:
data_energy_consumption[
                        (data_energy_consumption['quantity']>0)
                        &
                       ((data_energy_consumption['year']>2004)&(data_energy_consumption['year']<2011))
                        &
                       (data_energy_consumption['country'].isin(['Latvia', 'Lithuania', 'Estonia']))
                        &
                       (data_energy_consumption['category'].isin([4,12,21]))
                       ]['quantity'].sum()

240580.0

In [73]:
prib = data_energy_consumption[(data_energy_consumption['quantity']>0)&
       ((data_energy_consumption['year']>2004)&(data_energy_consumption['year']<2011))&
        (data_energy_consumption['country'].isin(['Latvia', 'Lithuania', 'Estonia']))&
        (data_energy_consumption['category'].isin([4,12,21]))]

In [75]:
len(prib)

347

In [76]:
prib.head(30)

         country  year  quantity  category
10617    Estonia  2008       1.0         4
10620    Estonia  2005       1.0         4
11156  Lithuania  2008       1.0         4
11158  Lithuania  2006       1.0         4
11159  Lithuania  2005       1.0         4
12755    Estonia  2008       1.0         4
12758    Estonia  2005       1.0         4
13294  Lithuania  2008       1.0         4
13296  Lithuania  2006       1.0         4
13297  Lithuania  2005       1.0         4
15525    Estonia  2008       1.0         4
15528    Estonia  2005       1.0         4
16068  Lithuania  2008       1.0         4
16070  Lithuania  2006       1.0         4
16071  Lithuania  2005       1.0         4
17675    Estonia  2008       1.0         4
17678    Estonia  2005       1.0         4
18218  Lithuania  2008       1.0         4
18220  Lithuania  2006       1.0         4
18221  Lithuania  2005       1.0         4
19854    Estonia  2008       1.0         4
19856    Estonia  2006       3.0         4
19857    Estonia  2005       6.0         4
20511  Lithuania  2008       1.0         4
20513  Lithuania  2006       1.0         4
20514  Lithuania  2005       1.0         4
21902    Estonia  2006       3.0         4
21903    Estonia  2005       5.0         4
25743    Estonia  2008       1.0         4
25746    Estonia  2005       1.0         4

In [49]:
len(data_energy_consumption[data_energy_consumption['country'].isin(['Latvia', 'Lithuania', 'Estonia'])])

1189482

In [46]:
data_energy_consumption[new].head(30)

Empty DataFrame
Columns: [country, year, quantity, category]
Index: []

In [31]:
new1 = data_energy_consumption['country'].isin(['Latvia'])

In [32]:
data_energy_consumption[new1].head()

  country  year  quantity  category
0  Latvia  1996       5.0         1
1  Latvia  1995      17.0         1
2  Latvia  2014       0.0         1
3  Latvia  2013       0.0         1
4  Latvia  2012      35.0         1

### Задание 3
Выберите страницу любого сайта с табличными данными. Импортируйте таблицы в pandas dataframe.
Примеры страниц (необязательно брать именно эти):

https://fortrader.org/quotes

https://www.finanz.ru/valyuty/v-realnom-vremeni

https://gks.ru/bgd/free/B04_03/IssWWW.exe/Stg/d02/37.htm

In [128]:
data_stocks_rus = pd.read_html('https://fortrader.org/quotes')[3]
data_stocks_rus.head()

                   Название      Цена  Изменение  Изменение(%)  Обновлено
0             ВТБ Акции ВТБ  0.044015  -0.000005     -0.011358        NaN
1    Газпром Акции газпрома    222.60  -0.270000     -0.120000        NaN
2       Лукойл Акции Лукойл   6 015.0  -5.000000     -0.100000        NaN
3   Роснефть Акции Роснефти    540.15   0.000000      0.000000        NaN
4  Сбербанк Акции Сбербанка    281.75   0.000000      0.000000        NaN

In [129]:
data_stocks_america = pd.read_html('https://fortrader.org/quotes')[4]
data_stocks_america.head()

,Название,Цена,Изменение,Изменение(%),Обновлено
0,Google Акции Google (GOOGL),2 235.01,-9.61,-0.43,NaN
1,IBM Акции IBM (IBM),134.48,-0.11,-0.08,NaN
2,Microsoft Акции Майкрософт (MSFT),256.05,0.14,0.05,NaN
3,Apple Акции Apple (AAPL),131.32,0.08,0.06,NaN
4,Yandex Акции яндекса,62.42,-0.43,-0.68,NaN